cask "iterm2"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# cli
brew "rg"
brew "jq"
brew "zellij"

# Browsers
cask "google-chrome"
cask "brave-browser"
cask "firefox@developer-edition"

# clipboard manager
cask "flycut"

# window arrangement manager
cask "rectangle"

# Password Managers
cask "1password-cli"
cask "1password"

# Markdown Notepad/Editor
cask "obsidian"

cask "spotify"

# Docker container Manager
cask "orbstack"

# Mac AppStore
brew "mas"

mas "Amphetamine", id: 937984704
