# terminal emulator
cask "ghostty"

tap "heroku/brew"
tap "ngrok/ngrok"
tap "withgraphite/tap"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# cli
brew "rg"
brew "jq"
brew "fd"
brew "bat"
brew "zellij"
# github cli
brew "gh"
brew "hub"
# AI 🤖 LLM runner
cask "ollama"

brew "heroku/brew/heroku"
brew "withgraphite/tap/graphite"
brew "tree"
brew "ripgrep"
brew "cbonsai"
cask "ngrok"

# Browsers
cask "google-chrome"
cask "brave-browser"
cask "firefox@developer-edition"

cask "postman"

# clipboard manager
cask "flycut"

# meeting status bar
brew "meetingbar"

# window arrangement manager
cask "rectangle"

# Password Managers
cask "1password-cli"
cask "1password"

# Markdown Notepad/Editor
cask "obsidian"

cask "spotify"

# Docker container Manager
cask "orbstack"

# Mac AppStore
brew "mas"

mas "Amphetamine", id: 937984704
# mas "Microsoft Remote Desktop", id: 1295203466
